CSI API ETABS v1
cAreaObj.GetOpening Method
 Retrieves whether the specified area object is an opening.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOpening(
	string Name,
	ref bool IsOpening
)
Function GetOpening (
	Name As String,
	ByRef IsOpening As Boolean
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim IsOpening As Boolean
Dim returnValue As Integer
returnValue = instance.GetOpening(Name,
	IsOpening)
int GetOpening(
	String^ Name,
	bool% IsOpening
)
abstract GetOpening :
        Name : string *
        IsOpening : bool byref -> int
Parameters
Name
Type: System.String
 The name of a defined area object.
IsOpening
Type: System.Boolean
 This item is True if the specified area object is an opening, otherwise it is False.
Return Value
Type: Int32
 The function returns zero if the assignment is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim IsOpening as Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'designate an area object as an opening
   ret = SapModel.AreaObj.SetOpening("3", True)
'retrieve whether area object is an opening
   ret = SapModel.AreaObj.GetOpening("3", IsOpening)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace